Revit 2026 API

# ExternalResourceBrowserData Properties

---

The ExternalResourceBrowserData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FolderPath | The current folder path to which the new resources and subfolder belong. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ServerId | The Id of IExternalResourceServer which handles the external resource load. |

#### Reference

ExternalResourceBrowserData Class

Autodesk.Revit.DB Namespace